Repository: Odix-Pay/odixpay-notifications
Catalog: src/OdixPay.Notifications.Contracts/Resources/LocalizationResources/SharedResource.*.resx
Languages: ar, fa, tr

source: An error occurred.
ar: حدث خطأ.
fa: خطایی رخ داد.
tr: Bir hata oluştu.

source: An unexpected error occurred.
ar: حدث خطأ غير متوقع.
fa: یک خطای غیرمنتظره رخ داد.
tr: Beklenmeyen bir hata oluştu.

# AnUnexpectedErrorOccurredWithDetails
source: An unexpected error occurred: {0}
ar: حدث خطأ غير متوقع: {0}
fa: یک خطای غیرمنتظره رخ داد: {0}
tr: Beklenmeyen bir hata oluştu: {0}

source: Bad request.
ar: طلب غير صالح.
fa: درخواست نامعتبر است.
tr: Geçersiz istek.

source: CreateNotificationRequest cannot be null.
ar: طلب إنشاء الإشعار لا يمكن أن يكون فارغًا.
fa: درخواست ایجاد اعلان نمی‌تواند خالی باشد.
tr: Bildirim oluşturma isteği boş olamaz.

source: Failed to send notification.
ar: فشل في إرسال الإشعار.
fa: ارسال اعلان ناموفق بود.
tr: Bildirim gönderilemedi.

source: Id is required.
ar: المعرف مطلوب.
fa: شناسه الزامی است.
tr: Kimlik gereklidir.

source: Internal server error.
ar: خطأ داخلي في الخادم.
fa: خطای داخلی سرور.
tr: Sunucu iç hatası.

source: Invalid email recipient provided.
ar: تم تقديم مستلم بريد إلكتروني غير صالح.
fa: گیرنده ایمیل نامعتبر ارائه شده است.
tr: Geçersiz e-posta alıcısı sağlandı.

source: InvalidPushRecipientProvided
ar: تم تقديم مستلم دفع غير صالح.
fa: گیرنده پوش نامعتبر ارائه شده است.
tr: Geçersiz push alıcısı sağlandı.

source: Invalid SMS recipient provided.
ar: تم تقديم مستلم رسالة نصية غير صالح.
fa: گیرنده پیامک نامعتبر ارائه شده است.
tr: Geçersiz SMS alıcısı sağlandı.

source: Invalid template variables provided.
ar: تم توفير متغيرات قالب غير صالحة.
fa: متغیرهای نامعتبر برای قالب ارائه شده است.
tr: Geçersiz şablon değişkenleri sağlandı.

source: Invalid Value For The Given Type
ar: قيمة غير صالحة لنوع البيانات المحدد.
fa: مقدار نامعتبر برای نوع داده داده شده.
tr: Verilen tür için geçersiz değer.

source: Notification ID cannot be empty.
ar: معرّف الإشعار لا يمكن أن يكون فارغًا.
fa: شناسه اعلان نمی‌تواند خالی باشد.
tr: Bildirim kimliği boş olamaz.

source: Notification recipient not found.
ar: لم يتم العثور على مستلم الإشعار.
fa: گیرنده اعلان پیدا نشد.
tr: Bildirim alıcısı bulunamadı.

source: Notification template not found.
ar: لم يتم العثور على قالب الإشعار.
fa: قالب اعلان پیدا نشد.
tr: Bildirim şablonu bulunamadı.

source: Operation completed successfully.
ar: اكتملت العملية بنجاح.
fa: عملیات با موفقیت انجام شد.
tr: İşlem başarıyla tamamlandı.

source: Permission must be specified in AuthorizeRole filter
ar: يجب تحديد الإذن في عامل تصفية AuthorizeRole
fa: مجوز باید در فیلتر AuthorizeRole مشخص شود
tr: AuthorizeRole filtresinde izin belirtilmelidir

source: Resource created successfully.
ar: تم إنشاء المورد بنجاح.
fa: منبع با موفقیت ایجاد شد.
tr: Kaynak başarıyla oluşturuldu.

source: Resource not found.
ar: المورد غير موجود.
fa: منبع پیدا نشد.
tr: Kaynak bulunamadı.

# TemplateInUseCannotBeDeleted
source: Template with ID '{0}' is currently in use and cannot be deleted.
ar: القالب بالمعرّف '{0}' قيد الاستخدام حاليًا ولا يمكن حذفه.
fa: قالب با شناسه '{0}' در حال استفاده است و نمی‌تواند حذف شود.
tr: Kimliği '{0}' olan şablon şu anda kullanımda ve silinemez.

source: Template variables do not match.
ar: متغيرات القالب غير متطابقة.
fa: متغیرهای قالب مطابقت ندارند.
tr: Şablon değişkenleri eşleşmiyor.

# TemplateWithIdNotFound
source: Template with ID '{0}' not found.
ar: لم يتم العثور على القالب بالمعرّف '{0}'.
fa: قالب با شناسه '{0}' یافت نشد.
tr: Kimliği '{0}' olan şablon bulunamadı.

# TemplateWithNameAlreadyExisit
source: Template with name '{0}' already exists.
ar: القالب بالاسم '{0}' موجود بالفعل.
fa: قالب با نام '{0}' از قبل وجود دارد.
tr: '{0}' adında bir şablon zaten mevcut.

# TemplateWithNameAlreadyExists
source: Template with name '{0}' already exists.
ar: القالب بالاسم '{0}' موجود بالفعل.
fa: قالب با نام '{0}' از قبل وجود دارد.
tr: '{0}' adında bir şablon zaten mevcut.

source: The requested resource was not found.
ar: المورد المطلوب غير موجود.
fa: منبع درخواستی یافت نشد.
tr: İstenen kaynak bulunamadı.

source: Unhandled exception occurred.
ar: حدث استثناء غير معالج.
fa: یک خطای غیرمنتظره رخ داد.
tr: Beklenmeyen bir hata oluştu.

source: User already has a token set for this type
ar: لدى المستخدم بالفعل رمز مخصص لهذا النوع.
fa: کاربر قبلاً برای این نوع یک توکن تنظیم کرده است.
tr: Kullanıcının bu tür için zaten bir token seti var.

source: User ID cannot be null or empty.
ar: لا يمكن أن يكون معرف المستخدم فارغًا أو معدومًا.
fa: شناسه کاربر نمی‌تواند خالی یا تهی باشد.
tr: Kullanıcı kimliği boş veya null olamaz.

source: User ID claim is missing or empty
ar: المطالبة بمعرّف المستخدم مفقودة أو فارغة
fa: ادعای شناسه کاربر وجود ندارد یا خالی است
tr: Kullanıcı kimliği talebi eksik veya boş

source: User ID is required.
ar: معرف المستخدم مطلوب.
fa: شناسه کاربر الزامی است.
tr: Kullanıcı kimliği gereklidir.

source: User ID not found in claims.
ar: معرف المستخدم غير موجود في المطالبات.
fa: شناسه کاربر در کلایمز پیدا نشد.
tr: Kullanıcı kimliği taleplerde bulunamadı.

source: User is not authorized for the requested action
ar: المستخدم غير مخوّل للإجراء المطلوب
fa: کاربر برای اقدام درخواستی مجاز نیست
tr: Kullanıcı istenen işlem için yetkili değil

# UserNotAuthenticated
source: User is not authenticated
ar: المستخدم غير مصادق
fa: کاربر احراز هویت نشده است
tr: Kullanıcı kimliği doğrulanmamış

source: User request cannot be null or empty.
ar: لا يمكن أن يكون طلب المستخدم فارغًا أو معدومًا.
fa: درخواست کاربر نمی‌تواند خالی یا تهی باشد.
tr: Kullanıcı isteği boş veya null olamaz.

source: User role claim is missing or empty
ar: المطالبة بدور المستخدم مفقودة أو فارغة
fa: ادعای نقش کاربر وجود ندارد یا خالی است
tr: Kullanıcı rolü talebi eksik veya boş
